Tekla Open API Reference for Tekla Structures 2025
Reinforcement.GetFatherPourUnit Method
 Returns the pour unit that the rebar is associated to.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PourUnit GetFatherPourUnit()
Public Function GetFatherPourUnit As PourUnit
Return Value
Type: PourUnit
A pour unit.
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace